docs: fix architecture diagram
